{"Theory-Zero":{"slug":"Theory-Zero","filePath":"Theory Zero.md","title":"Theory Zero","links":[],"tags":[],"content":" \n\t \n\t\t.page-title { \n\t\t\tfont-size: 1.70rem; \n\t\t\ttext-wrap: nowrap; \n\t\t\tmax-inline-size: 25vw; \n\t\t\t overflow: hidden; \n\t\t\t flex-wrap: no-wrap; \n\t\t}\n\t \n \nSynopsis:\nTheory Zero describes an ontological framework for thought and human organisation – think a description of an operating system for the mind – and then builds with this to a philosophy of information evolution. By alternating between the idea of ‘information selection,’ an abstraction of Darwinian Natural Selection, and the visceral, emergent reality, the book aims to explain and review known history and ideas from a new information centric perspective.\nWhile, at the core, this is just a a framework, readers can find value in applying this idea as a tool for systematic questioning of information and formalising ‘out-of-the-box’ thinking, such as for the identification of situational biases, novel applications of existing ideas, or predicting the state of a complex system composed of competing forces.\nNovelette updates monthly.\nPrologue: \nThe history of humanity is the history of ideas. To understand the evolution of human society, one is thus compelled to learn about the ideas of the different stages of human society, why some ideas became obsolete while others grew, and the what ‘ideas’ are in the first place. \nBefore I begin this chapter, let me assert one fundamental truth: this book and its contents were written in hindsight. This is meant to be a descriptive macro-view of history, covering the most salient points I have picked from my own readings. As such, it is by no means unbiased - in fact it is highly prone to survivor biases and my own willingness to engage with certain ideas. This is not a book trying draw conclusions, but is simply my attempt at both description and rationalization. \nAdditionally, I would like to acknowledge the overlap between ideas presented here and those argued in works by other, more capable authors. This book touches upon the subject of mematics, Darwinian natural selection, and the theory of knowledge itself, without necessarily taking them by name. I believe the true value of this book is not in the ideas themselves, but in their stringing together to make a more cohesive thought-system. However, the diversity means that ideas presented may concur with, contradict, or repeat existing theories. To the best of my abilities, I have pointed the reader in the direction of the source of the ideas that I have taken inspiration from, built upon, or used to further my own arguments, or quoted. This does not mean that my interpretation of such ideas is the only interpretation, and indeed I am sure some of my arguments within this book would go against the ideas of the authors who’s works I have built upon or modified. \nIn such cases, I request the reader to read through to the end. I believe it quite likely I have acknowledged such contradictions, attempted to explain them, or pointed in the direction of further reading that would enable the reader to accept and reject ideas based on their own judgement. \nLastly, I would highly encourage readers to explore ‘The Selfish Gene’ by Sir Richard Dawkins, as my own work is heavily inspired by it. I imagine Sir Dawkins would be rather disappointed in this work, however, as although much of it is similar to his own book, my work may appear to connect his own ideas of cultural selection to genetic selection - a direction I believe his book opposes rather strongly. I assure readers that, while my arguments do in fact connect to genetic natural selection and cultural selection, this is only incidental to a more elegant theory that is common to both. \nChapter 1: Ideas and Society\nChapter 1.1: What are ideas? \nTo understand what ideas are, we must first look at an even more atomic and pervasive object. Throughout history, knowingly or unknowingly, every being, human or otherwise, has used or drawn from this object their entire understanding of self. No ideology, scientific, real, illusory, or otherwise, exists that does not stem from this fundamental abstraction: the ‘model’. \nThe ‘model’ is, simply put, an image of a world. I say a world, because it does not necessitate that models created are models of reality. In fact, to the contrary, it can be argued that no model in the history of humanity has ever been a ‘true’ model - a model that reflects reality precisely. A model is the abstract representation of our understanding of a world. It is a system of using past information to deduce the rules that affect the objects within the system, in an effort to predict the outcomes of actions. \nIn other words, it is a theory. The more refined a model, the closer it is to reality, and thus the better its predictions. Models allow us to predict reality without comprehending it in its entirety. \nThose who have engaged with modern science to even a shallow extent will find nothing new in this concept. The Newtonian Theory of Gravity is a model for how gravity works. The Einstein Relativity theory is a Model for how time and space work. \nSome of the more discerning readers and thinkers might also find the following ideas intuitive, or even repetitive, but it is imperative that I state them nevertheless, as the foundation upon which rest of this narrative is built: all ideas are models, and exist within models. The ideas of science, the ideas of various religions, and even your billion dollar start-up idea all exist within models, and are in themselves models. Amongst these, however, the idea of a society in particular is of great interest to me, and I hope I shall share that in the coming text.\nChapter 1.2: Why a Society \nA society is a rather loose term, and deliberately so. Its vagueness stems from its vast jurisdiction of ideas. However, wholistically understanding this within the greater arguments of this book means this is not simply a matter of definition. As such, to understand what a society is, we must first look at why humans decided to form these. \nAs established, all ideas of the world are models. Thus, any living being that hopes to interact with the world in a predictable way - in a way it can predict, that is - makes use of a model, albeit to varying sophistication. The model of the world in a dog’s mind is likely very different from ours’. For example, their world may lack certain colours that ours does have, and the limited cognitive abilities also means that their model is less refined, or less robust. This manifests itself in many non-human animals in the form of what some perceive as less cognitively enabled beings. \nMost animals would, unsurprisingly, move away from a falling object. This shows that they are aware that the unobstructed object will fall towards the ground, and that, if caught in its path, injuries may result. This information in the animal’s mind is deduced from past experiences, and within its model for the world, it likely deduced the existence of a rule similar to what we humans call gravity. That is not to say it understands gravity in the true form, or even to the extent of many humans, but it is a model nonetheless with its own predictive capabilities. The specifics of an organism’s model’s capacity for sophistication is not of direct importance to us, however. What is the the deduction of a concept of time.\nTo organisms can think with a model sophisticated enough to understand time, one aspect of their reality becomes very, terrifyingly clear: uncertainty. If the first pillar of society and existence for humans is the desire to survive, then uncertainty would be the second such pillar to motivate humans to action. I am sure many readers will have ideas of their own ideas regarding that rather blanket statement, but I do request that you hold those thoughts until chapter 3, as I use the word survival to mean a rather unconventional continued existence, but I digress. To the early humans, and no doubt many other organisms, uncertainty reflected in a lack of a guarantee for the next meal, a lack of guarantee of survival the next moment, and so on. \nHumans are an evolutionary anomaly. I do not mean that we are special -far from it, but instead that we are a very unlikely species. The average human of 12,000 years ago (to say nothing of now) was a comparatively physiologically weaker organism in competition with far more powerful predators. This relegated our ancestors far from the pinnacle of the food chain: primarily scavengers, humans remained a backwater species of little note for a large part of our history. Some readers will be quick to point out that what I am now saying flies in the face of my previous arguments regarding sophisticated models and the predictive capabilities of a more cognitively able organism. This is in itself not a wholly unproductive thought: the intuitive line of reasoning would suggest that humans evolved the more complex brain because it gave them better models, thus allowing them better predictive abilities, and thus a survival advantage. There is likely truth to that, but there is a catch.\nThe brain is an energy sink like no other organ; despite making around 1/50th of the human body weight, it consumes up to a quarter of the body’s entire energy budget. This meant that for our ancestors, this cognitive boost came at a large caloric price, and evolution does not offer credit. The early human would have had to fund this cognitive development while wrestling with physiologically stronger species that stood atop the food chain.\nWith this context, I shall once more reiterate that humans are an extremely unlikely species, in the most literal sense. Anthropologists have long researched the question of how early humans achieved the caloric intake required to enable this direction of evolution, and answers seem as far now as they have been the past century. However, I did say that the aforementioned line of thinking may have some truth to it.\nSo far there has been the assumption that greater cognition gave humans a survival advantage - an assumption that I am as of yet to defend. In our modern world, this connection is easy to make: weapons as sophisticated as we have now could not have been achieved without our cognitive capabilities that sets us apart from contemporary species. But that does not explain what advantage this could have had to early humans, who had access to neither the sophisticated techniques, compounded knowledge, nor materials that we have come to possess over the ages.\nI have built the human image to be this special species, and that is what perhaps makes it difficult to see what the evolutionary advantage was, for this advantage was not limited to humans: the ability to collaborate. A more sophisticated brain allows for more sophisticated communication, and thus a way to band together, making up for weaker physiology with numbers. This idea, too, is not unique to humans; wolves form packs, hyenas roam in communities. In fact, it is not novel at all, for even apex predators like lions form prides that may hunt together.\nI do not argue that the ability to band together in itself was what gave humans the evolutionary edge - far from it, it was an evolutionary necessity. However, forming groups has a major drawback: unpredictability. Indeed, even in the modern world, one of the most unpredictable variables tends to be the human minds that inhabit it. \nWhile this may have formed a barrier for other species, this is perhaps where humans profited from their cognitive abilities: enhanced communication\nTo address this uncertainty evolved the third pillar of human society: communication. Although vastly differing in their sophistication and capabilities, both modern and ancient communication, as well as arguably all forms of communication of any kind between living beings, are in an effort to understand. To further expand this, let us understand why communication is so important to humans and life in general. \nThe formation of models, as previously established, requires rules. Rules, as explained, are deduced from information, and for all humans information comes in the form of interactions with the world through our 5 senses. Thus, interaction is the fundamental requirement for the formation of a model. For a model in a human’s mind that factors in other humans as a variable, we must therefore interact with other humans. \nTo some readers, this may signal that communication is a form of, or even a synonym of interaction, but it is not so, for we are still missing a key part of the bigger picture: feedback. \nRecall that models exist primarily as a means of predicting the consequences of actions. Thus, without experiencing consequences, a model cannot correct to align itself with reality better. This process of experiencing consequences and linking them to decisions arrived at with the model can be termed as ‘feedback’. A model that seeks to improve itself will change itself so that its chosen actions result in consequences as close to its predictions as it can get. \nIt is also interesting to note that in such a scenario, the model in one human’s mind is attempting to predict another human mind’s actions, which in itself are determined by a model. This implies that models are capable of not only interacting with, but forming predictions relating to each other. Such a conclusion in essence would be correct, although this is a very easily misinterpreted idea. For example, when you interact with your environment, even with conventionally non-living objects, you perform an action, a consequence results, and your senses provide information interpreted as feedback for your actions. This is your interaction with your non-living environment, constituting communication. And indeed this aligns with our definitions of reality and models, and also of interaction and communication. Every action is a form of communication, and exists for the sole purpose of providing a model with information. \nReturning to the question at hand, however, the idea that humans evolved communication is laughably lofty. It is perhaps, with our more mature understanding and definition of communication, apt to say that humans developed a more complex means of communication than the sounds and physical queues our animal brethren make use of: language. \nWhile it would be most interesting to fill the next few pages with musings of the abstractness of language as a model in itself, that would not lead us to the answer we are looking for in this chapter, and thus I leave that as an excercise to the reader and thinker. Instead, I shall concern myself with communication, and the advent of the fourth pillar of society: ideology. \nChapter 1.3: Language and Ideologies \nLanguage essentially allowed humans to peer into each other’s models deeper, and thus form more complex understandings of each other. It also enabled us to make information reception from our senses richer. While humans likely largely used their hearing as a means of detecting movement, it has become increasingly used as a form of communication, a medium for language, in recent history (roughly the last 12,000 years). This allowed us not only the ability to understand others, but to then influence others. \nRecall from Chapter 1.2 that models use feedback information to align themselves better with reality. This requires that a model make changes to itself, in order to produce different, more accurate predictions. Thus, if a model can predict another model, the former model will also be able to attempt to provide specific feedback to the latter model, in the hopes of changing it in a specific way. \nThis may seem manipulative or devious, and indeed this is the idea behind lies and half-truths. For the time that a person believes in a record of past events different to what actually transpired, their model is out of sync with reality, and thus their actions may not be what they would otherwise enact should they have had a more accurate model of reality, drawn from the right information feedback. \nHowever, it is also this same system of editing each other’s models that enables us to learn new things. This could be factual information, scientific theories, algebra, or religious ideas, or even the ideas of good table manners. All of these are the influence of the many models that we are surrounded by and take feedback from. \nHowever, this mutual editing of models leads to a rather interesting emergent effect: the formation of collective models. This is perhaps the most nuanced and complex pillar of society, and without which modern society would not exist in its current form. It is the glue that binds us, and finally provides the answer to the first pillar of uncertainty. It also is, perhaps, the most evolved pillar of the 4, and even individual strands of this pillar form entire factions and divide people to this day. \nThe term ‘ideology’ is vague, too, similar to ‘society’, but fret not dear reader, this time there is little to be gained from breaking down the term further, and thus I shall refrain from doing so. Instead, we have a much simpler way of dealing with this vagueness: defining ‘ideology’ in terms of the ‘model’. For our purposes, and I would argue most if not all human purposes too, an ideology is the term used for a model which exists in the minds of more than one individual.\nIt is a ‘shared model’ so to speak.\nI draw heavy inspiration from the ideas of Dr Yuval Noah Harare in this section, for his ideas on ‘shared realities’ is essentially the same as far as I can understand it. However, while he explains it from the top down with real world examples, we have built up to the idea from the bottom up by defining the more fundamental idea of models. \nSo, after all this, answering why humans form societies:\nA society is formed to bring order to humans in an otherwise uncertain world. By holding a shared model of reality, humans are able to cooperate effectively by essentially decreasing how uncertain they are of their fellow humans’ actions by communicating with and understanding each other. This cooperation brings security, ensuring survival. \nAt the heart of every human endeavour is survival. Society is a means of reducing the uncertainty around it, and thus a society collapses when it fails to convince its followers of its ideology’s predictive capability, or the ideology’s predictions are refuted with feedback to its followers. \nThat is to say, that a society draws purpose from what it gives to its followers, and gains power from the conviction its followers hold in its ideology. Like clothes, societies may choose to mend their ideologies, or cast them off altogether in the face of more capable ideologies throughout time, while still holding onto the other pillars. This has been seen very significantly in the cold war of the very recent human history, where without changing language, or perceived social systems of power, countries switched from communist ideologies to capitalistic ones in Europe.  Elsewhere, it can be seen in people joining and leaving religions. \nThe pillars of society may also make another thing very clear to readers, and that is that a society has no borders. Of course, a society whose ideology dictates a border may very well claim to have one, but it is not necessary for a society to do this. Religions in the conventional form are ideologies without borders. They have followers who believe, have a shared model of reality, are able to communicate with each other (if not in language, then in rituals, or common meeting grounds and other practices), and still do not have set boundaries. In a sense, to the conventional border-states that each have their own models (which often dictate who should be considered as part of one group or another) and by extension ideologies, conventional religions are a mirror world. Thus, it becomes possible to generally ascribe to multiple models of reality, each dealing with specific uncertainties and sometimes even making contrary predictions, though seldom provably so. \nWhen such proof does come about, however, it has the potential to shake conviction in a society’s ideology, and thus for conventionally religious societies, who draw their purpose and power from their ideology’s predictive power to answer uncertainties, they are often unable to simply cast off their ideology entirely. This leads to situations such as religious reforms, which in itself is also mirrored in the political world of ideologies in the more traditional legal and legislative reforms. \nIn other words, fundamentally, all societies are the same: they stem from shared models. They differ only in the specifics: the boolean of the presence or absence of borders, and the proportion of import that each pillar holds to that society. \nChapter 1.4: Chimeras\nThere have been many scholars far more competent and qualified than I who have argued both sides of the following debate, but that has not stopped me from giving my very own two cents’ worth these last few chapters, so why begin now? \nScience holds a special spot in human history. The ‘Society’ of scientists is unlike any predecessor, mainly because it is a society that demands its ideologies to be proven false. This is the only society I have come across as yet where conviction in its predictive capabilities grow stronger each time the ideology is shown to incorrectly predict reality. But why is Science an exception? \nI would propose that it is a part of a different class of models. In the same way that ideologies were a generation of models that differentiated their impact by being ‘shared’ models, models such as science are ‘meta,’ or chimera models, so to speak. They are the emergence of competing models, a collection of the ‘fittest’ models, the ones that predict reality the best. And each time one of these sub models are shown to be less fit than a new competing model, the sub model is switched for the new one. Science, on the whole, remains ever the same. \nSome may argue that Science is not the same, that it is evolving too, and to them there lies the task of answering the Ship of Theseus. Regardless of what the answer is, however, the fact remains that Science cannot be so simply explained in its approach to modelling reality as past ideologies. Perhaps, in the coming decades of humanity, we shall see more such meta models appear. Perhaps not. Perhaps science shall remain the only one. \nHowever, this rather simple view of society does not answer some critical questions hidden in the details. For one, it fails to explain the complexity of modern ideologies. Sure, laws bring about order, but many of them are not so bothered with basic human needs such as survival, nor do they try to answer existential questions. Additionally, I employed a rather interesting word a couple of paragraphs earlier that many readers would have picked up on: ‘fittest models’. Yes, I do mean that in terms of Darwinian natural selection, though I prefer to abstract the idea into a more generalised principle. To answer this, we must turn to the idea of Information Selection. \nAn interesting Aside: Atheism\nWhen I started writing this book, my goal was to describe and rationalise as much of human society as possible from within as minimalist a theory as possible. Needless to say, this meant attempting to explain all major religious ideas within the scope of this project with the idea of models and systems. However, when confronted with atheism, my thoughts have changed substantially since I wrote the first iteration of this chapter, and it holds some fascinating repercussions for how we can expect ideas to interact with each other within models.\nDuring the first iteration of this chapter, I attempted to explain atheism in terms of models in a manner that made it appear identical to religions. However, what I saw and learnt kept contradicting every explanation or rationalisation/system I came up with, and the issue was that I was hoping to explain atheism as an ideology in itself. However, I have come to realise that it may be much more accurate to call atheism a lack of subscription to conventional religious models.\nThis may seem unimpressive, and frankly, it’s not meant to be. What is fascinating to me is that the very idea of not needing to subscribe to a particular set of models is in itself a competing force for those models. This does call for what we consider ‘comparable’. I shall update this aside with my answers as I arrive at them.\nChapter 2: Information Selection \nChapter 2.1: An Introduction\nDear readers, I am sure it is not lost on you that I have deliberately omitted the use of ‘Natural Selection’ as the title. The importance is very much of concern to us, but we must start from Natural Selection to understand why. \nIn the previous chapter, I used the term fitness to describe a model. I arrived at the conclusion following the application of Natural Selection principles to models. I understand if you do not follow, or that seems illogical, but let me explain. And to do that, I shall require that you follow my train of thoughts as I have laid it out here, subject to your scrutiny. As to why I am doing this, that shall become obvious when we reach the end of this chapter. \nFirst, to see if my application of Natural Selection to models is even valid, we must define the rules that govern whether natural selection principles can be applied in a given system. Initially, to do this we can turn to the conventional understanding of natural selection: the emergent effect stemming from competition between different individual life forms for limited resources, resulting in the survival and propagation of those organisms with the traits allowing greatest chances of survival. \nHowever, this wording has a few flaws. If this were in fact the definition of the phenomenon of Natural Selection, many contradictions arise with reality. \nOften, it has been noted, that a mother tiger may eat a sick cub to replenish her strength. While that may not in itself be very surprising, it is far more interesting to note the lack of significant resistance from said cub. That goes against general understanding of natural selection: why would an organisms willingly accept its own end? We see such oddities even in human society: some of the most wildly ‘sucessful’ people in modern societies, particularly the heads to religions, may choose to be celibates - the antithesis to propagating one’s own genes. \nSome of you readers may be able to see where I am going with this, particularly readers of the Selfish Gene but Sir Richard Dawkins. I draw in part from his work in this section to build upon it a more generalised system of applying selection ideas, but I digress. \nThe answer to the seeming contradiction in the previous couple of paragraphs, to the generally understood concept of natural selection is thus: it is not the organisms that are being selected for, but their genes. \nWhen the sick cub, which already has limited chances of survival, is consumed by the parent, it enables the parent to live longer, perhaps enabling further births. Resources that would have otherwise gone to the sick cub can be redirected to its remaining siblings, thus increasing their chances of surviving. Crucial to note here, is that these siblings, and the parent, all draw from the same gene pool. In essence, a small number of instances of those genes ‘sacrificed’ themselves, so that there would be better chances of their clones surviving. If you see natural selection from the eyes of these genes, oddities such as celibates more than make sense in the fact that they increase the chance of the genes surviving. \nBut does this mean that natural selection is a system of selecting genes? Not quite, there is something to be said about the specific combinations of the genes, and the fact that new genes and traits arise as old ones become obsolete. Therein we are once again faced with the Ship of Theseus question, but that is not the most consequential part of this section. What is far more interesting, at least to me, is that we applied natural selection to something more fundamental than an organism: a gene. But what is a gene? The textbooks will helpfully let you know that they are a length of DNA that code for a specific protein; in essence they are information. \nThus, I propose the following rules for applying selection ideas: \n\nThere are limited resources \nThere are variants of comparable information \nSaid variants are competing for limited resources, such that the less competitive variants are filtered out with time \n\nNote the use of the word, ‘comparable’. Later in this section it will become obvious why I highlight that, but for now let us revel in our achievement: we have encapsulated the rules required for applying selection ideas to information in general, instead of just within natural selection’s biological context. I do acknowledge the shortcomings of the nebulous vocabulary, such as ‘comparable,’ without defining what comparable is, but I do not believe such a rigorous definition  is necessary to appreciate the ideas presented further in this book. \nWith that said, let us see if our ideas for societies fit these criteria. \nTo show that societies are in fact subject to selection, I would like to show that ideologies are subject to selection. Do note, that hidden within that sentence is the assumption that if ideologies are subject to selection, so too will be their societies - an assumption without foundation. But we shall get to that in due time. For the moment, we must concern ourselves only with ideologies, and answer each part of the question thoroughly. \nLooking at our requirements of selection theory: \n\nThe limited resources could be attributed to the strength or conviction of belief. Ideologies of the modern world and indeed the past must have believers, who are limited in number, to continue existing \nThe variants of comparable information can attributed to the existence of models that seek to answer the same questions (thus have the same purposes) but do so through varying means and lead to varying predictions (comparable, yet they are variants and not the same) \nVariants of ideologies may often require an adherent to choose between them, as is the case with most popular (conventional) religions of the 21st century as of writing this book. Thus, they are competing with each other for the limited resource: space. More precisely, mental space within which the belief in these ideological models exist, or in other words, believers \n\nNow, some readers may be quick to point out the fact that ideologies, as per my definitions, need not always compete. Since I said religion and politics are both societies with differing ideologies, this makes them comparable, and yet both a communist christian and a capitalist christian can simultaneously exist, without the conventional religion competing with the political ideology for their adherent’s belief, or as I termed it, ‘mental’ space. And such readers would be quite right: in such cases, the ideologies do not compete, and instead coexist. This can be seen in nature too, where species tha occupy different niches can coexist since they don’t compete for the same resources. Since competition is a key requirement for selection ideas, as stated in point three of our initial rules, we do not (not necessarily ‘cannot’) apply selection theories in such instances. \nI hope I have convinced you of the soundness in logic with my train of thoughts thus far. Take the time out to convince yourself about all of the above, before you proceed. \nConvinced? Fantastic. Now to the summit of this logical mountain we have been scaling! \nSince we have established that certain models may be in competition with each other, and the models at large fulfil the other 2 criteria we had laid out in the earlier sections of this chapter, we are now free to apply to them selection ideas. Since we are selecting based on variants of ‘Information,’ I shall henceforth refer to this as information selection, a broader application of the ideas of natural selection. \nI am sure to many readers the implications have already become obvious, most apparently so in the competition of conventional religions. \nMany an ancient human ideology, such as those based around religions, had a far smaller scope. Pagan religions of the past focussed on crowning inanimate objects as sacred dwellings of or as gods/spirits. Shifting to more recent modern history, the questions religion answered centred around morality, and more abstract concepts. Religions that, essentially, did this better than others, lead to more stable societies due to greater predictability. Since these ideologies were in competition with each other, the fitter religion survived. This would the the religion more capable of answering its questions: what comes after life, for instance. \nBut even if ideologies are in competition with each other that does not necessitate that societies are in competition with each other, too. The purpose of this entire train of thoughts, then, which was to attempt to answer the aspects of modern societies I mentioned in the ultimate section of chapter 4 (I would highly encourage you to reread the section to be reminded of the question asked) seems misdirected. That is because there is still another step we must take. \nTo attribute the aforementioned complexities of society as a product of the evolution of ideologies through information selection, I am now tasked with demonstrating that societies are also in competition with each other, and are linked to their ideological pillars. This flies in the face of my earlier statements, comparing ideologies to clothes, going so far as to say that a society may cast off its ideology in favour of a more competent one. Or does it? To answer this, let us take the example of the Roman Empire, and its many preceding forms.\nInitially started as a monarchy, Rome went through a series of transformations, into an oligarchy, into a democratically elected dictatorship, and then later once again to a monarchy as the empire grew and shrank. Through its lifespan, its chief ideologies changed drastically, and Roman ‘society’ changed from being a group of pagans to Christians later in history. However, throughout this rather tumultuous period survived another idea, one that remained in the background like the invisible puppet master of a show: the identity of being a Roman. \nIndeed, nationalities and all other ideas of the nature that we called our identity, if they are shared ideas, are ideologies. While certain ideologies such as the conventionally religious ideas may have competed with each other, the Roman identity was competing with an entirely different rival of its own: the Gauls and the Etruscans, later the Greeks and the Phoenicians. \nHere, we return once more to more conventional selection, in the context of our understanding of information selection. Here, the information variants are the various cultures that form parts of each society. The resources they are limited by is the space, food, currency, and many more. These are all, also, generally in competition with each other. \nTo summarise, these societies, particularly the judiciary ones, are part of neither political nor conventionally religious ideologies. They form their own kind, a cultural society. \nThis is not to say that there cannot be overlaps between these. Many religions demand certain laws, and some legislation may outlaw certain religious practices or groups, putting them into competition. Perhaps the most obvious historical example of these clashing were the crusades, though there is no dearth of examples elsewhere either. However, bringing in the extra variables in such a context does not lead to the answer we were looking for at the ultimate section of chapter 1.4, so I shall continue using the Roman example and highlight the most salient of points that lead most directly to our answer. \nTo recap, the judiciary and laws are part of a cultural society. These compete with other comparable societies, mainly on the enforcement of laws. Thus, the resource being competed for, in another form of mental space, is enforcement. People who believe in laws and enforce them make the laws a force in the real world. Conversely, without anyone to enforce them, the law and its society would not exist. Thus, once again, adherents are a resource being competed for. A Greek would follow different laws to a Roman, perhaps worship different gods, and have different traditions. \nWe are almost at our answer, but there is one more piece to the puzzle: what is the purpose of laws? \nWhile many would argue morality, fundamental logic or even sanctity, approaching this question in the context of the hitherto established pillars of society, I would argue that they answer the second pillar: uncertainty. \nWhen we communicate with reality (recall, communication as a form of interaction with feedback), we trust our environment to act predictably - or in other words, that the deduced rules will not change over time. This implicit assumption has plagued all ideas of models from the first chapter. It is just that, an assumption. However, being the most fundamental assumption, and also the only assumption made thus far save for the dichotomy of reality and the non-real, I shall instead refer to it with the much more elegant word: ‘postulate’. \nThus, I postulate, rather unsurprisingly, that rules endure regardless of situation. Anything that does not fit that criteria is not a rule. \nGoing back to our communication with the environment, we trust it implicitly because it does fulfil our postulate’s criteria: the laws of physics do not change, as far as we can tell or need to tell in daily life, and so we believe it and form our models around it. But what about other humans? \nEssentially, any society must attempt to enforce its synthetic laws with the same omnipotence and omnipresence as the natural laws in order to maintain its adherents, as this allows the adherents to be part of a more predictable, and thus less uncertain society. If another society appears more predictable, it will naturally outcompete a less predictable society, manifest through its stability. \nConventional religions are no exception to this, either, largely appealing to God or the natural forces which are attributed the same properties and powers (omnipotence and omnipresence should be familiar?). The societies able to better remain stable, outcompete others, may do so by enacting laws that do not necessarily involve answering more nuanced questions of modern societies - the need to answer this question arises from the competition with other societies that have their own variants of laws. \nThus, the survival of a society is directly linked not only to its ability to answer uncertainty in its absence, but to outcompete rival societies, leading to more complex systems than would evolve otherwise.\nChapter 2.2: Applying Information Selection\nThis chapter shall take a step away from the book’s tone thus far, and lean in to a more personal anecdote. So far this book has been mostly assertive of ideas presented, but not very explorative. That is, while there is a lot of information presented here, its application in the real world is not quite obvious. Going around with a checklist to see what phenomenon confirm to our checklist of requirements for selection ideas isn’t the most efficient manner of finding avenues to apply these ideas. As such, I’d like to share how I’ve come across these their applications thus far.\nMy first foray into applying selection theory outside the Darwinian context was with languages. This may appear completely unrelated to any of what I’ve spoken of thus far, and, loathe as I am to admit, it wasn’t this structured manner of thinking that lead me to applying those ideas. Nevertheless, I shall continue with that tone in the interest of keeping my thoughts legible.\nThe article that set it off was a rather innocuous one. This was before the advent of large language models, and the field of artificial intelligence research was still far from the mainstream. That said, fear sells, and fear mongering was as much an effective journalistic tactic as it is now. A rather well known tech company was experimenting with artificial intelligence technology at the time, and, as part of it, allowed 2 AIs to communicate with each other. These AIs were initially communicating in English, but were given the ability to improve the language to maximise their communications’ efficiency.\nI recall the article saying (not verbatim, for I do not remember the exact words, but the general idea was) that the AIs’ messages quickly diverged from standard English, with each level of improvement producing messages more incomprehensible to humans than the last. The article stated that the AIs had quickly evolved the language far beyond its current state, and this rendered their conversation, likely meaningful to each other, opaque to humans.\nThe plug was pulled on this experiment shortly after.\nThe truth was far less scary.\nWhile in my eyes the article painted a (rather convincing) picture of 2 AIs that had escaped human control and surpassed human cognition, a little bit of digging revealed that AIs developing specialised versions of languages was not a rare occurrence, and there was some additional, important context.\nThe AIs in question here were specialised to a specific task (I believe it was ‘negotiation’ as one source put it - vague as it is), and were allowed to refine their language to make their communications more efficient. As far as I can tell, the part of the system was expected to be a blackbox of sorts, and the ‘evolution’ of the language was essentially a trimming down of grammar and vocabulary that hindered the efficiency of this domain specific application of the language.\nThink of it like a programming language. To the average person it would appear cipher-like, perhaps even gibberish. But that isn’t to say it’s very different from general languages - they’re just specialised to their task. We do this too in our everyday lives. Have you ever had to search up the meaning of an acronym? ‘Tysm’ for ‘thank you so much’, ‘gtg’ for ‘got to go’. These are all instances where we have customised the English language to more efficiently convey information. Ofcourse, ‘gtg’ might mean something entirely different in another context, but you aren’t concerned with that when messaging. These are domain specific languages: created for a specific purpose, as opposed to general purpose languages.\nHowever, my attention was elsewhere: the idea that languages could evolve in the first place. This might not sound particularly profound, but there was some thought to it; whilst this wasn’t the first time I’d heard of ‘evolution’ outside biology - think terms like ‘evolving stories’ or ‘evolving cultures’, this particular instance stuck out in my mind because it had an additional keyword: efficiency, in this context, or more broadly put, an objective.\nTo me, though not so codified in my mind at the time, evolution was this vague idea of any steady though subtle change across time, in  a general context, and the idea that it converged at all was limited to the confines of biology. While this definition wasn’t necessarily wrong, what this particular article and its source incident pointed out to me was that there could be an objective being driven towards even outside of biology. Once again, I acknowledge this in itself is not a novel idea to have. But the combination of these 2 ideas: that evolution could occur in a context removed from biology, and that this evolution could converge at an ‘objective’ was fascinating.\nAt the time, the thought of applying this selection more widely had still not occured to me. Instead, I occupied the time I could spare with exploring the evolution of languages.\nFirst, a hypothesis! Rather uncreatively, I started with the hypothesis that languages evolve to convey ideas more efficiently. Doesn’t worry about whether this is right or wrong just yet, since that’s what we’re about to test!\nAnd with that, now to test it!\nAnd this was the eureka moment, or well, eureka process. To actually test the idea, I had to draw more granular parallels. This meant defining what part of languages were modelling genes, what counted as a generation, what counted as a mutation, and so on.\nWhile there aren’t absolute answers to these questions, I believe the system I came up with was at least satisfactory, if not obviously intuitive: I paralleled genes with meanings, an organism as a word, typos or ‘wrong’ applications of words (i.e. a deviation from their standard meaning) as ‘mutations’, and any instance of the word appearing as a generation. Really, there isn’t a lot of deep thought here: every appearance of a word is the idea/information given form, and an opportunity for the word to change. Every typo, misunderstanding, or reinterpretation/reapplication of the word is a chance for a new, similar-yet-different meaning to develop.\nTake for example the following paragraph:\nA rather unassuming building from the outside, the Chase was a contradictory mix within – warmth of a home mixed with the opulence of a palace – this impression struck from the very moment I set foot on that soft velvet carpet, a sprawling mass that covered the pristine hall. A second step garnered a subtle protest from the spruce wood floor below, if not for which I would have quite forgiven myself for believing the building to be little more than a few years of age. Still, before I could ponder it, I caught a reflection flitting across the walls, light scattered from the chandelier above painted somewhere between ivory and lunacia.\nA satisfactory paragraph, it’ll do for our analysis. Now, there was atleast one word within that paragraph that should be new to readers. No points for guessing, it’s lunacia. I won’t take credit for coining this word – I once came across it in a song but have not found any other significant references, much less formal definitions of the word.\nThat said, if I were to ask you, the reader to guess its meaning, I imagine you were picturing something along the lines of ‘moon-white’. The ‘luna’ within lunacia is an obvious allusion to the moon, but also equally importantly was the fact that the chandelier was painted implying that it is a colour. Additionally, the context of the colour being between lunacia and ivory further affirms the ‘white’ colour imagery.\nWhat was witnessed here was the birth of a new word from existing words and context. The surrounding words, combined with the pre-existent knowledge of luna alluding to the moon combined to give meaning to a new word. That said, this word is not identical to any other of the words in that paragraph – I hope what I conveyed there wasn’t just any white, but the cold yet bright glow of the moon.\nBut the cold yet bright glow of the moon is a rather unweildy sentence, if I can hitherto convey the same information with a single word: ‘lunacia’. Great! But that doesn’t mean much if others don’t utilise this new word, too. Sure, it’s efficient, but it won’t survive many generations if it only appears within this chapter, much less this book. This possibility is very likely mainly because this word, although a new word that does convey information more efficiently, is not particularly relevant to conversation. There aren’t going to be a whole lot of people going about their day describing the local chandeliers and what not as lunacian – at best it may find mention in a shade-chart for paint mixing.\nThis forms the second part: these words need to keep reproducing to stay alive as a species. Here, I think of the lifecycle of a word as\nmeaning in mind 1 → word → meaning in mind 2 → word\nYou would be forgiven at this point for confusing words and meanings between organisms and genes, since at this step, each word is being treated as a single-gene-organism. In fact, this is why Information Selection as a formalised system is important – the analogy of genes and inheritance can take us only so far when we make comparisons across fields, and thus relying on drawing parallels is both strained and clunky. Ofcourse, I had yet to realise this myself at the time, and thus this section shall continue drawing those clunky parallels. If at any point it gets too much to synthesise, feel free to apply the more refined Information Selection and the general principles of selection independent of their genetic counterparts.\nThat said, if this analogy has ‘clicked’ for you, I’m certain you would have taken note of the fact that meaning in mind 1 and meaning in mind 2 need not necessarily be the same. Going back to lunacia, for example, I was thinking ‘moon-white, cool yet bright’ as I incorporated the word into the sentence. However, if you happen to think the moon has a slight blue-ish tint, you would interpret the word to mean (perhaps) ‘calm, cool moon-like blue-ish white’. The meaning in my mind isn’t the same as yours, and should you be inclined to baffle your friends with such esoteric language, you would perhaps apply the word in a context I might not. This causes a drift in the meaning – a prime example of which is the word ‘guy’.\nA tiny detour to 1605\nText to be added soon.\nAuthor’s December Note:\nWow – this chapter took quite a while to add. And to be honest, a lot of that lies with me rethinking some of the ideas presented here, and better arguing them. Counter to how it may seem, a lot of what’s here is written in a (mildly edited) stream-of-consciousness style, which means hitting a wall means I rethink a lot of where I’d like this book to go next! In fact, anyone reading this over the months would also notice that the chapters have been renumbered now to better reflect the shifts in focus.\nWith that said, if you’re curious as to what the next section of this chapter is going to be about, I’d encourage you to read up about the history of the word ‘guy’ (hint: yes, it’s linked to a festival). Ofcourse, you could wait for the next section to come out, which aims to focus on drawing even more parallels in a similar yet different way to the above!\nTill then,  a Merry Christmas and a Happy New Year!"},"index":{"slug":"index","filePath":"index.md","title":"index","links":[],"tags":[],"content":" \n\t \n\t\twindow.location.href = `shashankraocoding.github.io/Theory-Zero/Theory-Zero.html` \n\t \n \n \n\t \n\t\t.page-title { \n\t\t\tfont-size: 1.70rem; \n\t\t}\n\t \n"}}